---
kind: enumMember
id: F:Autodesk.Revit.DB.PointCloudColorMode.Normals
enum: Autodesk.Revit.DB.PointCloudColorMode
source: html/12e4d06d-3d5f-53d6-7be9-97bed63ec47b.htm
---
# Autodesk.Revit.DB.PointCloudColorMode.Normals

Color by normal vectors